perf/results/timeout/timeout_node.log

> perf@1.0.0 artillery /Users/mmariotti/Documents/UBA/1c20-tp-1/perf
> artillery "run" "timeout.yaml" "-e" "node"

Started phase 0 (Ramp), duration: 30s @ 19:41:42(-0300) 2020-05-24
Report @ 19:41:52(-0300) 2020-05-24
Elapsed time: 10 seconds
  Scenarios launched:  54
  Scenarios completed: 22
  Requests completed:  22
  Mean response/sec: 5.44
  Response time (msec):
    min: 4999.2
    max: 5006.1
    median: 5000.8
    p95: 5005
    p99: 5006.1
  Codes:
    200: 22

Report @ 19:42:02(-0300) 2020-05-24
Elapsed time: 20 seconds
  Scenarios launched:  111
  Scenarios completed: 85
  Requests completed:  85
  Mean response/sec: 11.12
  Response time (msec):
    min: 4999
    max: 5015.4
    median: 5001.3
    p95: 5005.8
    p99: 5013.9
  Codes:
    200: 85

Report @ 19:42:12(-0300) 2020-05-24
Elapsed time: 30 seconds
  Scenarios launched:  174
  Scenarios completed: 140
  Requests completed:  140
  Mean response/sec: 17.4
  Response time (msec):
    min: 4999.3
    max: 5005.7
    median: 5001.2
    p95: 5004
    p99: 5005.1
  Codes:
    200: 140

Started phase 1 (Plain), duration: 120s @ 19:42:13(-0300) 2020-05-24
Report @ 19:42:22(-0300) 2020-05-24
Elapsed time: 40 seconds
  Scenarios launched:  199
  Scenarios completed: 191
  Requests completed:  191
  Mean response/sec: 19.92
  Response time (msec):
    min: 4997.6
    max: 5009.2
    median: 5000.6
    p95: 5004.1
    p99: 5006.7
  Codes:
    200: 191

Report @ 19:42:32(-0300) 2020-05-24
Elapsed time: 50 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 4997.7
    max: 5004.4
    median: 5000
    p95: 5002.5
    p99: 5003.8
  Codes:
    200: 200

Report @ 19:42:42(-0300) 2020-05-24
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 4997.3
    max: 5005.8
    median: 5000.1
    p95: 5002.4
    p99: 5003.5
  Codes:
    200: 200

Report @ 19:42:52(-0300) 2020-05-24
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 4998.1
    max: 5006.8
    median: 5000.6
    p95: 5003.4
    p99: 5004.9
  Codes:
    200: 200

Report @ 19:43:02(-0300) 2020-05-24
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 4997.9
    max: 5005.1
    median: 5000.3
    p95: 5002.6
    p99: 5004.8
  Codes:
    200: 200

Report @ 19:43:12(-0300) 2020-05-24
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 4997.6
    max: 5003.2
    median: 5000
    p95: 5002.1
    p99: 5003.1
  Codes:
    200: 200

Report @ 19:43:22(-0300) 2020-05-24
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 4997.5
    max: 5013.8
    median: 5000.2
    p95: 5002.9
    p99: 5008.1
  Codes:
    200: 200

Report @ 19:43:32(-0300) 2020-05-24
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 4997.9
    max: 5009.1
    median: 5000.2
    p95: 5003
    p99: 5005
  Codes:
    200: 200

Report @ 19:43:42(-0300) 2020-05-24
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 4998
    max: 5009.1
    median: 5000.1
    p95: 5002.7
    p99: 5003.9
  Codes:
    200: 200

Report @ 19:43:52(-0300) 2020-05-24
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 4998.1
    max: 5010.4
    median: 5000.1
    p95: 5002.1
    p99: 5005.2
  Codes:
    200: 200

Report @ 19:44:02(-0300) 2020-05-24
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 4998.2
    max: 5007.9
    median: 5000.3
    p95: 5003.3
    p99: 5004.1
  Codes:
    200: 200

Report @ 19:44:12(-0300) 2020-05-24
Elapsed time: 2 minutes, 30 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 4997.8
    max: 5006.6
    median: 5000.5
    p95: 5003.1
    p99: 5005.3
  Codes:
    200: 200

Report @ 19:44:18(-0300) 2020-05-24
Elapsed time: 2 minutes, 35 seconds
  Scenarios launched:  9
  Scenarios completed: 109
  Requests completed:  109
  Mean response/sec: 1.66
  Response time (msec):
    min: 4998.7
    max: 5012.8
    median: 5001.7
    p95: 5005.1
    p99: 5009.5
  Codes:
    200: 109

All virtual users finished
Summary report @ 19:44:18(-0300) 2020-05-24
  Scenarios launched:  2747
  Scenarios completed: 2747
  Requests completed:  2747
  Mean response/sec: 17.68
  Response time (msec):
    min: 4997.3
    max: 5015.4
    median: 5000.3
    p95: 5003.2
    p99: 5005.3
  Scenario counts:
    timeout: 2747 (100%)
  Codes:
    200: 2747